#include<iostream>
using namespace std;
/*
* 1. `~` 按位取反：直接对**内存里的补码所有比特位取反（0 变 1，1 变 0）**，得到新补码。
2. 拿到新补码之后：
   - 如果最高位是 0（正数）：补码 = 原码，直接转十进制
   - 如果最高位是 1（负数）：**要把补码转回对应的十进制负数（不是直接把二进制当成原码去算！）
   -x = ~x + 1
*/
int main() {
	//1.按位取反的定义(~)
	int a = 0b00000000000000000000000000000001;
	int b = 0b11111111111111111111111111111110;
	//反码： 0b11111111111111111111111111111101;
	//原码： 0b10000000000000000000000000000010; 等于-2

	cout << (~a) << endl;
	cout << b << endl;
	int c = 0b0;
	cout << (~c) << endl;
	//0b00000000000000000000000000000000==0
	//0b11111111111111111111111111111111==-1
	//0b11111111111111111111111111111110==-2


	//2.求相反数
	int d = 18;
	cout << (~d + 1) << endl;
	//为什么+1？因为负数要转回十进制的数，经历从补码到原码，补码到反码时要减1，所以要加1



	/*
	补码的巧妙之处：**加法电路可以统一处理正数、负数，不需要单独减法器**
	减法 (a-b) 等价于 (a+(-b))，也就是 (a + (~ b +1))。
	*/
	return 0;
}