#include<iostream>
using namespace std;
//位与运算符定义：&(把二进制的两个数每一位从低到高进行与运算)
int main() {
	//1.位与运算符定义
	int a = 0b1010;//10
	int b = 0b0110;//6
	//		0b0010；//2
	cout << (a & b) << endl;
	cout << "--" << endl;


	//2.奇偶性
	//正常
	cout << 5 % 2 << endl;//%优先级高，效率低
	//位与:就看最低位有没有1来判断，其他位无影响
	cout << (5 & 1) << endl;//&优先级低，效率高
	//& 优先级比 == 低！
	//if(x & 1 == 1)   // 错误！等价 if( x & (1 == 1) ) → if(x & 1) ，正数碰巧对，逻辑是错的
	//if ((x & 1) == 1)// 正确，必须加括号
	cout << "--" << endl;

	//3.获取一个数二进制的后五位
	int c = 0b1010010101001;
	cout << (c & 0b11111) << endl;
	cout << "--" << endl;

	//4.将末五位归0
	int d = 0b11111111111111111111111111100000;
	cout << (c & d) << endl;
	cout << "--" << endl;
	
	//5.消除末尾连续的1
	int e = 0b10101011111;
	// e+1= 10101100000;
	//  & = 10101000000;
	cout << (e & (e + 1)) << endl;
	cout << "--" << endl;

	//6.2的幂次判断
	int f = 0b100000000;
	//f-1 = 0b011111111;
	// &  = 0;
	cout << ((f > 0) && ((f - 1) & f)==0) << endl;
	return 0;
}