#include<iostream>
using namespace std;
//右移：>>
//算术右移规则：右移丢掉最右边 1 位，左边空位，复制符号位填充
//x>>y:x/（2^y）(向下取整)
//(-5/2 = -2.5)，向下取整是 -3
/*
* 有符号 int（int）

正数右移：左边补 0，等价除以\(2^n\)，向下取整，行为确定
负数右移：算术右移，左边补 1（C++ 标准允许部分老编译器逻辑右移，但几乎所有现代编译器都是算术右移）
（若右移不补1，结果会变成正数）

无符号 unsigned int

不管原来是大数（高位为 1），一律逻辑右移，左边补 0，没有算术右移。
*/
int main() {
	//1.正数右移
	int a = 0b111;
	a = (a >> 1);
	cout << a << endl;

	//2.负数右移
	int b = -1;
	b = (b >> 1);//负数右移：算术右移，左边补 1
	cout << b << endl;

	//3.去掉低k位
	int c = 0b10000101;
	cout << (c >> 7) << endl;

	//4.取到第低k位的值（eg:取第5个）
	int d = 0b101010101;
	cout << ((d >> 4) & 1) << endl;



	return 0;
}